using System.Linq;
using AskAbout.Models;

namespace AskAbout.Data
{
    public static class DbInitializer
    {
        public static Topic[] GetInitialData()
        {
            return new[]
            {
                "Авто, Мото",
                "Бизнес, Финансы",
                "Города и Страны",
                "Гороскопы, Магия, Гадания",
                "Досуг, Развлечения",
                "Еда, Кулинария",
                "Животные, Растения",
                "Знакомства, Любовь, Отношения",
                "Искусство и Культура",
                "Компьютерные и Видео игры",
                "Компьютеры, Связь",
                "Красота и Здоровье",
                "Наука, Техника, Языки",
                "Образование",
                "Общество, Политика, СМИ",
                "Программирование",
                "Путешествия, Туризм",
                "Работа, Карьера",
                "Семья, Дом, Дети",
                "Спорт",
                "Стиль, Мода, Звезды",
                "Товары и Услуги",
                "Философия, Непознанное",
                "Фотография, Видеосъемка",
                "Юмор",
                "Юридическая консультация"
            }.Select((name, i) => new Topic {Id = i + 1, Name = name}).ToArray();
        }
    }
}